# melt, pivot으로 Tidy data 만들기

In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame({'bar':['A','B','C','A','B','C'],'baz':[1,2,3,4,5,6], 'foo':['one','two','one','two','one','two']})
df

  bar  baz  foo
0   A    1  one
1   B    2  two
2   C    3  one
3   A    4  two
4   B    5  one
5   C    6  two

In [9]:
df.pivot(index = 'foo', columns = 'bar', values = 'baz')

bar  A  B  C
foo
one  1  5  3
two  4  2  6

In [10]:
df3 = df.pivot(index = 'foo', columns = 'bar', values = 'baz').reset_index()

In [22]:
df3

bar  foo  A  B  C
0    one  1  5  3
1    two  4  2  6

메소드 체인으로 sort_value, rename까지 한번에 해보기

In [20]:
df3. melt(id_vars = ['foo'], value_vars = ['A','B','C']).sort_values(['foo','bar']).rename(columns = {'foo' : 'f'})

     f bar  value
0  one   A      1
2  one   B      5
4  one   C      3
1  two   A      4
3  two   B      2
5  two   C      6

---------------------
<정리>


pd.melt(df)는 컬럼 -> 열 

df.pivot(columns =, values =)는 열 -> 컬럼